[
    {
        "id":1,
        "index":"01",
        "title":"EasyTopUp VTU",
        "link":"vtu.icopystory.com",
        "summary":"A VTU (virtual top up) website where users can own a virtual wallet (Paystack payment gateway integration), purchase AIRTIME, make DATA SUBSCRIPTION, pay UTILITY BILLS",
        "tech":"React.js, MaterialUI, Bootstrap, Redux, Axios, Redux toolkit, Typecript, Node, MongoDB, Mongoose, Express, Joi-browser, Bcrypt, JsonWebToken, NodeMailer, TsNode, .env, Moment.js, CORS middleware",                     
        "target":"https://vtu.icopystory.com/",
        "details":"EASYTOPUP provide services base values that continues to grow rapidly, offering dipensal of services that span various categories including Data subscription, cable sub, electric bill, Airtime top up and much more. EASYTOPUP range of services are designed to ensure optimum levels of convenience and customer satisfaction with the reliable E-WALLET, other optimum services include affordable price guarantee, Automated, Reliability, dedicated customer service support and many other premium services. As EASYTOPUP continue to expand the Platform, our scope of offerings will increase in variety, simplicity and conveniency, join us today and enjoy the increasing benefits.. ",  
        "pages":"Home, user Login, Register, Admin Panel, User panel, Wallet funding page...",
        "image":"vtu.png",
        "role":"I solely designed the fulstack architecture of thi website. I built the front end user interface and the backend API, and then connected the UI with the backend API by enabling  cross origin resource sharing "
    },
    {
        "id":2,
        "index":"02",
        "title":"The Next Stage Lab Community ",
        "link":"tnsl.netlify.app (development phase)",
        "summary":"An online community where users from various regions can collaborate to earn, learn  post jobs and lot more",
        "tech":"React.js, MaterialUI, Bootstrap, Axios, Ably (web Socket library), Joi-browser",                     
        "target":"https://tnsl.netlify.app/",
        "details":"The next stage lab community is an online community of affiliate marketing, Freelancing, Cryptocurrency e.t.c. Users are required to create an account where they will have access to more options, such as Job postings and so on  ",  
        "pages":"Home, recipe details",
        "image":"tnsl2.png",
        "role":"I solely designed the front end and consumed the backend APIs"
    },
    {
        "id":3,
        "index":"03",
        "title":"MedEase",
        "link":"Postman API documentation",
        "summary":"Medease is a technical solution that provides progressive, and affordable healthcare, accessible on mobile and online for students and the staff of OAU. ",
        "tech":"NodeJs, MongoDB, Mongoose, Express",
        "target":"https://medease.vercel.app/",
        "details":"Medease is a technical solution that provides progressive, and affordable healthcare, accessible on mobile and online for students and the staff of OAU.",   
        "pages":"Home, login, signUp, upload document, admin dashboard, user dashboard...",
        "image":"medease.png",
        "role":"I worked along side my team members to develop the API that serves both the android and web application. ",
        "apiDocUrl":"https://documenter.getpostman.com/view/11384363/UVJkBZ6t"
    },
    {
        "id":4,
        "index":"04",
        "title":"Blog website",
        "link":"hamidstories.great-site.net",
        "summary":"A blog website that enables the admin to upload posts including images. Users can comment and like any post ",
        "tech":"JQUery, PHP, Bootstrap, MySQL",
        "target":"http://hamidstories.great-site.net/",
        "details":"A blog website that enables the admin to upload posts including images. Users can comment and like any post",   
        "pages":"Home, post content, post, Upload file",
        "image":"blog.png",
        "role":"I designed the Front end and backend of this website solely. I pushed the working version to production"
    },
    {
        "id":5,
        "title":"GTA Real Estate",
        "link":"gtarealestatealade.com.ng",
        "summary":"A real estate and property management agency that manages properties of their customers ",
        "tech":"Bootstrap, JQuery, PHP, PHPMailer, MySQL",
        "tectArr":["Bootstrap", "JQuery", "PHP", "PHPMailer", "MySQL"],
        "index":"05",
        "target":"https://www.gtarealestatealade.com.ng/",
        "details":"A Real estate and property management agency website. Users are able to create accounts and login. Users can order for any available property displayed in the home page while the admin receives notification of the order placed via email",    
        "pages":"Home, Login, SignUp, Dashboard, Order page",
        "image":"project-2.png",
        "role":"I designed the Front end and backend of this website solely. I pushed the working version to production. I ensured to adhere to SEO (search engine optimization) best practise "
    }
]